# GetPartStatusDescription Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricationConfiguration..::..GetPartStatusDescription Method
FabricationConfiguration Class See Also
---
Gets the status description from its identifier.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017 Subscription Update
# Syntax
C#
---
```text
public string GetPartStatusDescription(
	int statusId
)
```

Visual Basic
---
```text
Public Function GetPartStatusDescription ( _
	statusId As Integer _
) As String
```

Visual C++
---
```text
public:
String^ GetPartStatusDescription(
	int statusId
)
```

# ### Parameters
statusId
    Type: System..::..Int32 The status identifier.
# ### Return Value
The status description.
# See Also
FabricationConfiguration Class
Autodesk.Revit.DB Namespace